Label Encoding

Dataset

In [85]:
import pandas as pd

# Dataframe
dfA = pd.DataFrame({
    "country":['Netherland', 'Germany', 'UK', 'Germany', 'UK', 'Netherland'],
    "age":[28, 30, 35, 33, 22, 28],
    "salary(USD)":[72000, 65000, 98000, 45000, 34000, 27000]
})
dfA

      country  age  salary(USD)
0  Netherland   28        72000
1     Germany   30        65000
2          UK   35        98000
3     Germany   33        45000
4          UK   22        34000
5  Netherland   28        27000

Label Encoding

In [86]:
from sklearn.preprocessing import LabelEncoder
labEncod = LabelEncoder()
dfA["country"] = labEncod.fit_transform(dfA["country"])
dfA = dfA
dfA

   country  age  salary(USD)
0        1   28        72000
1        0   30        65000
2        2   35        98000
3        0   33        45000
4        2   22        34000
5        1   28        27000

In [87]:
labEncod.classes_

array(['Germany', 'Netherland', 'UK'], dtype=object)

One Hot Encoding

In [88]:
# Dataframe
dfB = pd.DataFrame({
    "country":['Netherland', 'Germany', 'UK', 'Germany', 'UK', 'Netherland'],
    "age":[28, 30, 35, 33, 22, 28],
    "salary(USD)":[72000, 65000, 98000, 45000, 34000, 27000]
})
dfB

      country  age  salary(USD)
0  Netherland   28        72000
1     Germany   30        65000
2          UK   35        98000
3     Germany   33        45000
4          UK   22        34000
5  Netherland   28        27000

Reshape The Data

In [89]:
X = dfB["country"].values.reshape(-1, 1)
X

array([['Netherland'],
       ['Germany'],
       ['UK'],
       ['Germany'],
       ['UK'],
       ['Netherland']], dtype=object)

In [90]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder()
X = ohe.fit_transform(X).toarray()
X

array([[0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [91]:
ohe.categories_

[array(['Germany', 'Netherland', 'UK'], dtype=object)]

In [92]:
dfOneHot = pd.DataFrame(X, columns=[str(i) for i in range(X.shape[1])])
dfOneHot

     0    1    2
0  0.0  1.0  0.0
1  1.0  0.0  0.0
2  0.0  0.0  1.0
3  1.0  0.0  0.0
4  0.0  0.0  1.0
5  0.0  1.0  0.0

In [93]:
dfB = pd.concat([dfOneHot, dfB], axis= 1)
dfB

     0    1    2     country  age  salary(USD)
0  0.0  1.0  0.0  Netherland   28        72000
1  1.0  0.0  0.0     Germany   30        65000
2  0.0  0.0  1.0          UK   35        98000
3  1.0  0.0  0.0     Germany   33        45000
4  0.0  0.0  1.0          UK   22        34000
5  0.0  1.0  0.0  Netherland   28        27000

In [95]:
dfB.drop(["country"], axis=1)

     0    1    2  age  salary(USD)
0  0.0  1.0  0.0   28        72000
1  1.0  0.0  0.0   30        65000
2  0.0  0.0  1.0   35        98000
3  1.0  0.0  0.0   33        45000
4  0.0  0.0  1.0   22        34000
5  0.0  1.0  0.0   28        27000